/*
用'-'(减号)、'+'(加号)、'*'星号和空格打印方格。

输入格式:
只有一行，为用空格分隔的两个整数l,c（0<l,c<10）。
其中l和c分别代表格子的行数和列数。请看输入样例。

输出格式:
每组测试用例输出一组。请看输出样例。

输入样例一:
2 3

输出样例一:
*--+--*--+--*--+--*
*  *  *  *  *  *  *
*--+--*--+--*--+--*
*  *  *  *  *  *  *
*--+--*--+--*--+--*
*  *  *  *  *  *  *
*--+--*--+--*--+--*
*  *  *  *  *  *  *
*--+--*--+--*--+--*

输入样例二:
3 2

输出样例二:
*--+--*--+--*
*  *  *  *  *
*--+--*--+--*
*  *  *  *  *
*--+--*--+--*
*  *  *  *  *
*--+--*--+--*
*  *  *  *  *
*--+--*--+--*
*  *  *  *  *
*--+--*--+--*
*  *  *  *  *
*--+--*--+--*
*/
#include <stdio.h>
int main(){
    int l, c;
    scanf("%d%d",&l, &c);
    for (int j = 1; j <= l; j++) {
        for (int i = 1; i <= c; i++) {
            printf("*--+--");
        } printf("*\n");

        for (int i = 1; i <= c; i++) {
            printf("*  *  ");
        } printf("*\n");

        for (int i = 1; i <= c; i++) {
            printf("*--+--");
        } printf("*\n");
        for (int i = 1; i <= c; i++) {
            printf("*  *  ");
        } printf("*\n");
    }
    for (int i = 1; i <= c; i++) {
            printf("*--+--");
        } printf("*\n");
    
    return 0;
}